run/dropletTest/constant/smoothFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      smoothFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// fields to be smoothed
fieldNames
(
C
);

// smoothing methods
algebraicSmooting yes;
laplacianSmooting no;

// parameters for algebraic smoothing
nAlgebraicSmooths 10;

// parameters for laplacian smoothing
alpha             alpha [0 0 0 0 0 0 0] 0.5; 
beta              beta [0 0 0 0 0 0 0] 1.0;

// ************************************************************************* // 
