run/dropletTest/0/u
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       preCellVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ((0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));

boundaryField
{
    top
    {
        type            dirichlet;
        value           uniform ((0.0088788825 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
    }
    bottom
    {
        type            dirichlet;
        value           uniform ((-0.0088788825 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
    }
    left
    {
        type            homogenous;
        value           uniform ((0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
    }
    right
    {
        type            homogenous;
        value           uniform ((0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
    }
    frontAndBack
    {
        type            homogenous;
        value           uniform ((0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
    }
    // front
    // {
    //     type            homogenous;
    //     value           uniform ((0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
    // }
    // back
    // {
    //     type            homogenous;
    //     value           uniform ((0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
    // }
}

// boundaryField
// {
//     top
//     {
//         type            dirichlet;
//         value           uniform ((0.0088788825 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
//     }

//     bottom
//     {
//         type            dirichlet;
//         value           uniform ((-0.0088788825 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
//     }
//     left
//     {
//         type            dirichlet;
//         // value           nonuniform List<List<vector>>
//         value           nonuniform
// 35
// (
// ((-0.866854285714 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.815862857143 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.764871428571 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.71388 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.662888571429 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.611897142857 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.560905714286 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.509914285714 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.458922857143 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.407931428571 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.35694 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.305948571429 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.254957142857 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.203965714286 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.152974285714 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.101982857143 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.0509914285714 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.0509914285714 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.101982857143 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.152974285714 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.203965714286 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.254957142857 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.305948571429 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.35694 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.407931428571 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.458922857143 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.509914285714 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.560905714286 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.611897142857 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.662888571429 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.71388 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.764871428571 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.815862857143 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.866854285714 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// )
// ;
//     }
//     right
//     {
//         type            dirichlet;
//         // value           nonuniform List<List<vector>>
//         value           nonuniform
// 35
// (
// ((-0.866854285714 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.815862857143 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.764871428571 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.71388 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.662888571429 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.611897142857 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.560905714286 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.509914285714 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.458922857143 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.407931428571 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.35694 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.305948571429 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.254957142857 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.203965714286 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.152974285714 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.101982857143 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-0.0509914285714 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((-1.44674385444e-19 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0) (-0 0 0 0 0 0 0 0 0 0))
// ((0.0509914285714 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.101982857143 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.152974285714 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.203965714286 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.254957142857 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.305948571429 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.35694 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.407931428571 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.458922857143 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.509914285714 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.560905714286 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.611897142857 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.662888571429 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.71388 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.764871428571 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.815862857143 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// ((0.866854285714 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0))
// )
// ;
//     }

//     frontAndBack
//     {
//         type            homogenous;
//         value           uniform ((0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0) (0 0 0 0 0 0 0 0 0 0));
//     }
// }


// ************************************************************************* //


// ************************************************************************* //
